#Область ПрограммныйИнтерфейс

// Вызывается из переопределяемого модуля.
// см. ОбщийМодуль.ДатыЗапретаИзмененияПереопределяемый.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения()
//
Процедура ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных) Экспорт

	//++ Локализация
   //++ НЕ БЗК
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "РегистрНакопления.ТМЦВЭксплуатации",            "Период", "СписанияОприходованияТоваров", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВводОстатковТМЦВЭксплуатации",                            "Дата", "РегламентныеОперации", "Организация");	
	//-- НЕ БЗК
	
	//++ НЕ УТ
	//++ НЕ БЗК
	ДатыЗапретаИзмененияБП.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных);
	//-- НЕ БЗК
	ЗарплатаКадры.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных);
	
	//++ НЕ БЗК
	

	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеВЭксплуатации",             "Дата", "СписанияОприходованияТоваров", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеИзЭксплуатации",               "Дата", "СписанияОприходованияТоваров", "Организация");

	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВыбытиеДенежныхДокументов",				"Дата", "Банк", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПоступлениеДенежныхДокументов",			"Дата", "Банк", "Организация");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РегламентнаяОперация",					"Дата", "РегламентныеОперации", "Организация");
	
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВыпускПродукции",						"Дата", "Производство", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеМатериаловВПроизводстве",		"Дата", "Производство", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПередачаМатериаловВПроизводство",        "Дата", "СписанияОприходованияТоваров", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВозвратМатериаловИзПроизводства",        "Дата", "СписанияОприходованияТоваров", "Организация");
	
	// Учет ОС и НМА
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.АмортизацияНМА",                     "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.АмортизацияОС",                      "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВводОстатковВнеоборотныхАктивов",    "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВозвратОСОтАрендатора",              "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ВыбытиеАрендованныхОС",              "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеСостоянияОС",               "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИнвентаризацияОС",                   "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИнвентаризацияНМА",                  "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеПараметровОС",              "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ИзменениеПараметровНМА",             "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.МодернизацияОС",                     "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.МодернизацияНМА",                    "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.КорректировкаНалоговогоНазначенияОС","Дата", "ВнеоборотныеАктивы", "Организация");		
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПередачаОСАрендатору",               "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеОС",                      "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПеремещениеНМА",                     "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПереоценкаНМА",                      "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПереоценкаОС",                       "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПодготовкаКПередачеОС",              "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПодготовкаКПередачеНМА",             "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПоступлениеАрендованныхОС",          "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПоступлениеПредметовЛизинга",        "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПринятиеКУчетуНМА",                  "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.ПринятиеКУчетуОС",                   "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеНМА",                        "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.СписаниеОС",                         "Дата", "ВнеоборотныеАктивы", "Организация");
	ДатыЗапретаИзменения.ДобавитьСтроку(ИсточникиДанных, "Документ.РемонтОС",                           "Дата", "ВнеоборотныеАктивы", "Организация");
	

    

	РеглУчетСервер.ЗаполнитьИсточникиДанныхДляПроверкиЗапретаИзменения(ИсточникиДанных);
	//-- НЕ БЗК
	//-- НЕ УТ
	//-- Локализация

КонецПроцедуры

// Позволяет изменить работу интерфейса при встраивании.
//
// см. ОбщийМодуль.ДатыЗапретаИзмененияПереопределяемый.НастройкаИнтерфейса()
//
Процедура НастройкаИнтерфейса(НастройкиРаботыИнтерфейса) Экспорт
	
	//++ Локализация
	//-- Локализация
	
КонецПроцедуры

// Заполняет разделы дат запрета изменения, используемые при настройке дат запрета.
// Если не указать ни одного раздела, тогда будет доступна только настройка общей даты запрета.
//
// см. ОбщийМодуль.ПриЗаполненииРазделовДатЗапретаИзменения.НастройкаИнтерфейса()
//
Процедура ПриЗаполненииРазделовДатЗапретаИзменения(Разделы) Экспорт
	
	//++ Локализация
	//++ НЕ УТ
	ЗарплатаКадры.ПриЗаполненииРазделовДатЗапретаИзменения(Разделы);
	//-- НЕ УТ
	
	//++ НЕ БЗК
	Раздел = Разделы.Добавить();
	Раздел.Имя  = "БухгалтерскийУчет";
	Раздел.Идентификатор = Новый УникальныйИдентификатор("2bdf6479-8eaf-4ec0-93a1-412e8659a178");
	Раздел.Представление = НСтр("ru='Бухгалтерский учет';uk='Бухгалтерський облік'",МультиязычностьУкр.КодЯзыкаИнформационнойБазы());
	Раздел.ТипыОбъектов.Добавить(Тип("СправочникСсылка.Организации"));
	//-- НЕ БЗК
	//-- Локализация
	
КонецПроцедуры


// Позволяет переопределить выполнение проверки запрета изменения произвольным образом.
//
// см. ОбщийМодуль.ДатыЗапретаИзмененияПереопределяемый.ПередПроверкойЗапретаИзменения()
//
Процедура ПередПроверкойЗапретаИзменения(Объект,
                                         ПроверкаЗапретаИзменения,
                                         УзелПроверкиЗапретаЗагрузки,
                                         ВерсияОбъекта) Экспорт
	
	//++ Локализация
	Если ОбщегоНазначения.ЭтоРегистр(Объект.Метаданные())
	 И Объект.Отбор.Найти("Регистратор") <> Неопределено Тогда
		ТипРегистратора = ТипЗнч(Объект.Отбор.Регистратор.Значение); // это набор записей документа-регистратора
	Иначе
		ТипРегистратора = Неопределено;
	КонецЕсли;
	
	ТипОбъекта = ТипЗнч(Объект);
		
	//++ НЕ УТ
	ЗарплатаКадры.ПередПроверкойЗапретаИзменения(
		Объект,
		ПроверкаЗапретаИзменения,
		УзелПроверкиЗапретаЗагрузки,
		ВерсияОбъекта);
		
	//++ НЕ БЗК	
	// Регл. учет
	// Для всех документов-регистраторов, если типом объекта является набор записей отражение документов в регл. учете, включаем проверку,
	//	так как проверка на форме дат запрета не распросраняется на проверку возможности формирования проводок:
	УстановленоСвойствоОтсутвияПроверки = Объект.ДополнительныеСвойства.Свойство("ПроверкаДатыЗапретаИзменения") И Не Объект.ДополнительныеСвойства.ПроверкаДатыЗапретаИзменения;
	Если Не ПроверкаЗапретаИзменения И ТипОбъекта = Тип("РегистрСведенийНаборЗаписей.ОтражениеДокументовВРеглУчете") И Не УстановленоСвойствоОтсутвияПроверки Тогда
		ПроверкаЗапретаИзменения = Истина;
	КонецЕсли;
	//-- НЕ БЗК
	//-- НЕ УТ
	
	//++ НЕ БЗК
	//-- НЕ БЗК
	//-- Локализация
	
КонецПроцедуры

#КонецОбласти