#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Настройки размещения отчетов
// см. ОбщийМодуль.ВариантыОтчетовПереопределяемый.ОпределитьРазделыСВариантамиОтчетов()
//
Процедура ОпределитьРазделыСВариантамиОтчетов(Разделы) Экспорт
	
	//++ Локализация
    //++ НЕ БЗК
	Разделы.Добавить(Метаданные.Подсистемы.РегламентированныйУчет,
		НСтр("ru='Отчеты по регламентированному учету';uk='Звіти по регламентованому обліку'"));
	//-- НЕ БЗК	
		
	//++ НЕ УТ
	//++ НЕ БЗК
	Разделы.Добавить(Метаданные.Подсистемы.РегламентированныйУчет.Подсистемы.СтандартныеОтчеты, 
		НСтр("ru='Стандартные бухгалтерские отчеты';uk='Стандартні бухгалтерські звіти'"));
	//-- НЕ БЗК	
		
	ЗарплатаКадрыПереопределяемый.ОпределитьРазделыСВариантамиОтчетов(Разделы);
	//-- НЕ УТ
	//-- Локализация
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Настройки команд отчетов
// см. ОбщийМодуль.ВариантыОтчетовПереопределяемый.ОпределитьОбъектыСКомандамиОтчетов()
//
Процедура ОпределитьОбъектыСКомандамиОтчетов(Объекты) Экспорт
	
	//++ Локализация
	//++ НЕ БЗК
	Объекты.Добавить(Метаданные.Документы.КоммерческоеПредложениеКлиенту);
	Объекты.Добавить(Метаданные.Документы.ЛистКассовойКниги);
	Объекты.Добавить(Метаданные.Документы.ТранспортнаяНакладная);
	Объекты.Добавить(Метаданные.Документы.КорректировкаОбособленногоУчетаЗапасов);
	Объекты.Добавить(Метаданные.Документы.ВводОстатковТМЦВЭксплуатации);
	
	
	//++ НЕ УТ
	Объекты.Добавить(Метаданные.Документы.ВозвратМатериаловИзПроизводства);
	Объекты.Добавить(Метаданные.Документы.ВыбытиеДенежныхДокументов);
	Объекты.Добавить(Метаданные.Документы.ВыпускПродукции);
	Объекты.Добавить(Метаданные.Документы.ДепонированиеЗарплаты);
	Объекты.Добавить(Метаданные.Документы.ИзделияИЗатратыНЗП);
	Объекты.Добавить(Метаданные.Документы.ПередачаМатериаловВПроизводство);
	Объекты.Добавить(Метаданные.Документы.ПеремещениеВЭксплуатации);
	Объекты.Добавить(Метаданные.Документы.ПеремещениеМатериаловВПроизводстве);
	Объекты.Добавить(Метаданные.Документы.ПоступлениеДенежныхДокументов);
	Объекты.Добавить(Метаданные.Документы.СписаниеЗатратНаВыпуск);
    Объекты.Добавить(Метаданные.Документы.СписаниеИзЭксплуатации);
	Объекты.Добавить(Метаданные.Обработки.ЖурналДокументовПоТМЦВЭксплуатации);
	
	// ЗарплатаКадрыПриложения.ОтражениеВФинансовомУчете
	Объекты.Добавить(Метаданные.Документы.ОтражениеЗарплатыВФинансовомУчете);
	// Конец ЗарплатаКадрыПриложения.ОтражениеВФинансовомУчете
    
    Объекты.Добавить(Метаданные.Документы.МодернизацияНМА);
    Объекты.Добавить(Метаданные.Документы.ПеремещениеНМА);
    Объекты.Добавить(Метаданные.Документы.РемонтОС);
	//-- НЕ УТ
    



	//++ НЕ УТ
    РеглУчетСервер.ОпределитьОбъектыСКомандамиОтчетов(Объекты);
	//-- НЕ УТ
	//-- НЕ БЗК
	
	//-- Локализация

КонецПроцедуры

// Задает настройки размещения вариантов отчетов в панели отчетов.
// см. ОбщийМодуль.ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов()
// 
Процедура НастроитьВариантыОтчетов(Настройки) Экспорт
	
	//++ Локализация
	ВыводитьВариантыОтчетов = Ложь;
	//++ НЕ БЗК
	//++ НЕ УТ
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.ДанныеДляБазыРаспределенияРасходов);
	//-- НЕ УТ
	//-- НЕ БЗК
	// ИнтернетПоддержкаПользователей
	ИнтеграцияПодсистемБИП.ПриНастройкеВариантовОтчетов(Настройки);
	// Конец ИнтернетПоддержкаПользователей
	
	//++ НЕ БЗК
	
	
	//++ НЕ УТ        	
	#Область ДенежныеДокументы
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ВедомостьПоДенежнымДокументам);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ВедомостьПоДенежнымДокументам");
	ОписаниеВарианта.Описание = НСтр("ru='Какие денежные документы есть на предприятии?';uk='Які грошові документи є на підприємстві?'");
	#КонецОбласти
	//-- НЕ УТ
	
	
	#Область ИмпортныеТоварыКОформлению
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ИмпортныеТоварыКОформлению);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ИмпортныеТоварыКОформлению");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьИмпортныеЗакупки");
	ОписаниеВарианта.Описание = НСтр("ru='По каким товарам не оформлены таможенные декларации?';uk='За якими товарами не оформлені митні декларації?'");	
	#КонецОбласти
	
	
	#Область НастройкаСписка
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.НастройкаСписка);
	ВариантыОтчетовУТПереопределяемый.ОтключитьОтчет(ОписаниеОтчета);
	#КонецОбласти
	
	#Область РеестрТорговыхДокументов
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РеестрТорговыхДокументов);
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, ВыводитьВариантыОтчетов);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ВариантыОтчетовУТПереопределяемый.УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "СмТакже");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Ложь;
	ОписаниеВарианта.Описание = НСтр("ru='Список всех торговых документов';uk='Список всіх торгових документів'");
	#КонецОбласти
	
	#Область СверкаДанныхПартионногоУчетаИСебестоимости 
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СверкаДанныхПартионногоУчетаИСебестоимости);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СверкаДанныхПартионногоУчетаИСебестоимости");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПартионныйУчет");
	ОписаниеВарианта.Описание = НСтр("ru='Сверка движений по регистрам партионного учета и движений по регистру себестоимости.';uk='Звірка рухів по регістрах партіонного обліку і рухів по регістру собівартості.'");
	#КонецОбласти

	#Область СверкаРасчетовСПартнерами
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СверкаРасчетовСПартнерами);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru='Анализ задокументированных сверок расчетов с клиентами.
|Есть ли расхождения между данными от клиента и нашими?'
|;uk='Аналіз задокументованих звірок розрахунків з клієнтами.
|Є розбіжності між даними від клієнта і нашими?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СверкаРасчетовСПартнерами");
	ОписаниеВарианта.Описание = НСтр("ru='Анализ задокументированных сверок расчетов с клиентами.
|Есть ли расхождения между данными от клиента и нашими?'
|;uk='Аналіз задокументованих звірок розрахунків з клієнтами.
|Є розбіжності між даними від клієнта і нашими?'");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "СверкаРасчетовСПартнерамиКонтекст");
	#КонецОбласти
	

	#Область ТоварныйОтчетТОРГ29
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ТоварныйОтчетТОРГ29);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.НастройкиДляПоиска.НаименованияПараметровИОтборов = НСтр("ru='Период
                                                                               |Организация
                                                                               |Склад
                                                                               |Номер отчета'
                                                                               |;uk='Період
                                                                               |Організація
                                                                               |Склад
                                                                               |Номер звіту'");
	ОписаниеВарианта.Описание =  НСтр("ru='Товарный отчет для анализа розничных продаж.';uk='Товарний звіт для аналізу роздрібних продажів.'");
	#КонецОбласти

	#Область МатериалыВЭксплуатации
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.МатериалыВЭксплуатации);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьВнутреннееПотребление");
	ОписаниеВарианта.Описание = НСтр("ru='Сколько и каких товарно-материальных ценностей передано сотрудникам в эксплуатацию?';uk='Скільки і яких товарно-матеріальних цінностей передано співробітникам в експлуатацію?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ТМЦВЭксплуатации");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьВнутреннееПотребление");
	ОписаниеВарианта.Описание = НСтр("ru='Сколько и каких товарно-материальных ценностей передано сотрудникам в эксплуатацию?';uk='Скільки і яких товарно-матеріальних цінностей передано співробітникам в експлуатацію?'");
	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ТМЦВЭксплуатацииКонтекст");
	#КонецОбласти

	#Область СверкаДанныхПартионногоУчетаИСебестоимости 
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.СверкаДанныхПартионногоУчетаИСебестоимости);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "СверкаДанныхПартионногоУчетаИСебестоимости");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользоватьПартионныйУчет");
	ОписаниеВарианта.Описание = НСтр("ru='Сверка движений по регистрам партионного учета и движений по регистру себестоимости.';uk='Звірка рухів по регістрах партіонного обліку і рухів по регістру собівартості.'");
	#КонецОбласти

	//++ НЕ УТ
	#Область АнализЗатрат
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.АнализЗатрат);
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru='Каковы затраты подразделений за период?';uk='Які витрати підрозділів за період?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "АнализПроизводственныхЗатрат");
	ОписаниеВарианта.Описание = НСтр("ru='Каковы затраты подразделений за период?
                                      |Какова структура затрат за период и остаток незавершенного производства?'
                                      |;uk='Які витрати підрозділів за період?
                                      |Яка структура витрат за період і залишок незавершеного виробництва?'");
	#КонецОбласти
					
	#Область ДвижениеМатериаловПолуфабрикатовРаботВПроизводстве
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ДвижениеМатериаловПолуфабрикатовРаботВПроизводстве);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, ВыводитьВариантыОтчетов);

	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвижениеМатериаловПолуфабрикатовРаботВПроизводстве");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользуетсяТолькоУправлениеПроизводством21");
	ОписаниеВарианта.Описание = НСтр("ru='Каковы затраты производства по материалам, полуфабрикатам и работам?
                                      |Куда распределены затраты производства?
                                      |Каковы остатки материалов, полуфабрикатов в производстве?'
                                      |;uk='Які витрати виробництва по матеріалах, напівфабрикатах і роботах?
                                      |Куди розподілені витрати виробництва?
                                      |Які залишки матеріалів, напівфабрикатів у виробництві?'");

	ОтключитьВариант = Ложь;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвижениеМатериаловПолуфабрикатовРаботВПроизводстве21");
	ОписаниеВарианта.ФункциональныеОпции.Добавить("ИспользуетсяУправлениеПроизводством21и22");
	ОписаниеВарианта.Описание = НСтр("ru='Каковы затраты производства по материалам, полуфабрикатам и работам?
                                      |Куда распределены затраты производства?
                                      |Каковы остатки материалов, полуфабрикатов в производстве?'
                                      |;uk='Які витрати виробництва по матеріалах, напівфабрикатах і роботах?
                                      |Куди розподілені витрати виробництва?
                                      |Які залишки матеріалів, напівфабрикатів у виробництві?'");

	ВариантыОтчетовУТПереопределяемый.ОтключитьВариантОтчета(Настройки, ОписаниеОтчета, "ДвижениеМатериаловПолуфабрикатовРаботВПроизводствеКонтекст");
	#КонецОбласти
	
	//-- НЕ БЗК
	
	#Область ЗарплатаКадры
	// Для всех отчетов разделов "Зарплата" и "Кадры" устанавливаем вывод отчетов вместо вариантов.
	ВыводитьВариантыОтчетов = Ложь;
	КоллекцияОтчетов = Метаданные.Отчеты;
	Для Каждого Отчет Из КоллекцияОтчетов Цикл
		Если ЗарплатаКадры.ОбъектМетаданныхВключенВПодсистемы(Отчет.ПолноеИмя(), "ЗарплатаКадрыПодсистемы,ЗарплатаКадрыРасширеннаяПодсистемы,ЗарплатаКадрыПриложения") Тогда
			ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Отчет);
			ВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, ОписаниеОтчета, ВыводитьВариантыОтчетов);
		КонецЕсли;
	КонецЦикла;
	
	ЗарплатаКадрыОтчеты.НастроитьВариантыОтчетов(Настройки);
	ЗарплатаКадрыКомандныйИнтерфейс.НастроитьВариантыОтчетов(Настройки);
	
	ВариантыОтчетов.НастроитьОтчетВМодулеМенеджера(Настройки, Метаданные.Отчеты.КнигаУчетаДепонентов);
	#КонецОбласти
	
	//++ НЕ БЗК

	#Область МатериалыВПроизводствеПоСрокамГодности
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.МатериалыВПроизводствеПоСрокамГодности);
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ОписаниеВарианта.Описание = НСтр("ru='По каким материалам скоро истекает срок годности?';uk='По яких матеріалах скоро закінчується строк придатності?'");
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ОстаткиТоваровПоСрокамГодности");
	ОписаниеВарианта.Описание = НСтр("ru='По каким материалам скоро истекает срок годности?
                                      |Сколько таких материалов и в каких они подразделениях?'
                                      |;uk='По яких матеріалах скоро закінчується строк придатності?
                                      |Скільки таких матеріалів і в яких вони підрозділах?'");
	#КонецОбласти		
		

	#Область ПроизводственныеЗатраты
	ОписаниеОтчета = ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.ПроизводственныеЗатраты);
	ОписаниеОтчета.Описание = НСтр("ru='Сводная информация о затратах (материалах, выполненных видах работ и постатейных расходах), партиях производства и выпущенной продукции в разрезе организаций.';uk='Зведена інформація про витрати (матеріали, виконані види робіт і постатейні витрати), партії виробництва і випущеної продукції в розрізі організацій.'");
	ОписаниеОтчета.ОпределитьНастройкиФормы = Истина;

	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "ДвижениеТМЦиПроизводственныеЗатратыПоПредприятию");
	ОписаниеВарианта.Описание = НСтр("ru='Сводная информация о затратах (материалах, выполненных видах работ и постатейных расходах), партиях производства и выпущенной продукции по предприятию.';uk='Зведена інформація про витрати (матеріали, виконані види робіт і постатейні витрати), партії виробництва і випущеної продукції по підприємству.'");

	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "");
	ВариантыОтчетовУТПереопределяемый.УстановитьВажностьВариантаОтчета(ОписаниеВарианта, "Важный");
	#КонецОбласти

	#Область РасшифровкаПоступлениеМатериаловВПроизводство
	ВариантыОтчетовУТПереопределяемый.ОтключитьОтчет(ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РасшифровкаПоступлениеМатериаловВПроизводство));
	#КонецОбласти


	#Область РасшифровкаРасходовНаПроизводство
	ВариантыОтчетовУТПереопределяемый.ОтключитьОтчет(ВариантыОтчетов.ОписаниеОтчета(Настройки, Метаданные.Отчеты.РасшифровкаРасходовНаПроизводство));
	#КонецОбласти



	
	//++ НЕ УТ
	РеглУчетСервер.НастроитьВариантыОтчетов(Настройки);
	//-- НЕ УТ
	
	//-- НЕ БЗК
	
	//-- Локализация
		
КонецПроцедуры

// Содержит описания изменений имен вариантов отчетов. Используется
//   при обновлении информационной базы, в целях контроля ссылочной целостности
//   и для сохранения настроек варианта, сделанных администратором.
//
//   (см. подробнее ВариантыОтчетовПереопределяемый.ЗарегистрироватьИзмененияКлючейВариантовОтчетов).
// 
Процедура ЗарегистрироватьИзмененияКлючейВариантовОтчетов(Изменения) Экспорт
	
	//++ Локализация
	//++ НЕ БЗК
	ВариантыОтчетовУТПереопределяемый.ДобавитьИзменениеКлючей(Изменения, "УправленческийБаланс", "ПоОрганизациям", "УправленческийБаланс");
	//-- НЕ БЗК
	//-- Локализация
	
КонецПроцедуры

//++ НЕ БЗК

#Область ДосьеКонтрагента

// Добавляет команду отчета в список команд.
// 
// Параметры:
//   КомандыОтчетов - См. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//
Функция ДобавитьКомандуДосьеКонтрагента(КомандыОтчетов) Экспорт
	
	//++ Локализация
	//-- Локализация
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти

//-- НЕ БЗК

#КонецОбласти
